[
  {
    "bodyPart": "Warmup",
    "exercise_name": "Straight Leg Marches",
    "description": "From a standing position, kick your right foot straight up in front of you to about waist height, stretching your hamstring. Bring it back down, then repeat with the left leg, moving forward.",
    "user_name": "0"
  },
  {
    "bodyPart": "Warmup",
    "exercise_name": "Forward Lunges",
    "description": "Begin standing with your feet together. Lift your right foot off the floor and take a large step forward. Bend your right knee and lower your hips until your right thigh is parallel to the floor — or until the position becomes uncomfortable, whichever comes first. Aim to keep your back straight, your upper body still and your back foot planted. Return to the starting position and repeat with the left leg.",
    "user_name": "0"
  },
  {
    "bodyPart": "Warmup",
    "exercise_name": "Side Lunges",
    "description": "From standing, take one big step to the right, keeping your toes facing forward and your heels pressing into the floor. Bend your hips and your right knee as you shift your weight onto your right foot. Continue until your left leg is nearly fully extended and your right knee hovers over the second toe of your right foot. Return to standing, and repeat on the left side.",
    "user_name": "0"
  },
  {
    "bodyPart": "Warmup",
    "exercise_name": "Hip Cradles",
    "description": "Sitting all day can tighten hip flexor muscles; this exercise helps activate and lengthen them. Stand with your feet hip-width apart, then take a step forward with your left leg. Lift your right knee and rotate your leg so your shin is parallel to the floor, grabbing your right ankle with your left hand near your hip. Keep your right hand on your right knee, gently “cradling” and pulling the leg up toward your chest. Release, step forward with the right leg and repeat on the other side.",
    "user_name": "0"
  },
  {
    "bodyPart": "Warmup",
    "exercise_name": "Side Lying T Spine Rotation",
    "description": "Lie down on your back. Bend your right knee and bring it over your left side so that it is almost touching the floor to your left. Grab behind the right knee with your left hand to hold it down. Stretch your right arm out to your right side, laying it flat on the floor (with your palm facing upward), and look towards it. Keeping your right arm straight, bring it over to your left side to touch the floor palm down. Turn your head to follow your right hand throughout the motion",
    "user_name": "0"
  }
]